{"class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"batch_input_shape": [null, 64, 64, 3], "name": "input_1", "sparse": false, "dtype": "float32"}}, {"class_name": "Lambda", "name": "lambda_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001zr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa;/home/vinohith/Self_driving_car/Behavioral_cloning/model.py\u00da\b<lambda>\u000e\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "trainable": true, "output_shape_type": "raw", "name": "lambda_1", "arguments": {}}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "config": {"padding": "valid", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 24, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "activation": "linear", "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "strides": [2, 2], "dilation_rate": [1, 1], "bias_constraint": null}}, {"class_name": "ELU", "name": "elu_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["elu_1", 0, 0, {}]]], "config": {"rate": 0.2, "name": "dropout_1", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"padding": "valid", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 36, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "activation": "linear", "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "strides": [2, 2], "dilation_rate": [1, 1], "bias_constraint": null}}, {"class_name": "ELU", "name": "elu_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["elu_2", 0, 0, {}]]], "config": {"rate": 0.2, "name": "dropout_2", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"padding": "valid", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 48, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "activation": "linear", "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "strides": [2, 2], "dilation_rate": [1, 1], "bias_constraint": null}}, {"class_name": "ELU", "name": "elu_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "name": "dropout_3", "inbound_nodes": [[["elu_3", 0, 0, {}]]], "config": {"rate": 0.2, "name": "dropout_3", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"padding": "valid", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 64, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "activation": "linear", "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null}}, {"class_name": "ELU", "name": "elu_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "name": "dropout_4", "inbound_nodes": [[["elu_4", 0, 0, {}]]], "config": {"rate": 0.2, "name": "dropout_4", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"padding": "valid", "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "filters": 64, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "activation": "linear", "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null}}, {"class_name": "ELU", "name": "elu_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "name": "dropout_5", "inbound_nodes": [[["elu_5", 0, 0, {}]]], "config": {"rate": 0.2, "name": "dropout_5", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "units": 100, "use_bias": true, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "ELU", "name": "elu_6", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "name": "dropout_6", "inbound_nodes": [[["elu_6", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_6", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "units": 50, "use_bias": true, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "ELU", "name": "elu_7", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "name": "dropout_7", "inbound_nodes": [[["elu_7", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_7", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "units": 10, "use_bias": true, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "bias_regularizer": null, "bias_constraint": null}}, {"class_name": "ELU", "name": "elu_8", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"name": "elu_8", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "name": "dense_4", "inbound_nodes": [[["elu_8", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "units": 1, "use_bias": true, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "bias_regularizer": null, "bias_constraint": null}}], "output_layers": [["dense_4", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.0.9", "backend": "tensorflow"}